In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('iris_code.csv')

In [3]:
data.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [6]:
data['Species'].value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Species, dtype: int64

# 1. Fetch 5 Random Samples From The Dataset

In [9]:
# get any random sample data from data frame by using sample(), default value of n=1
data.sample(n=5)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
12,13,4.8,3.0,1.4,0.1,Iris-setosa
26,27,5.0,3.4,1.6,0.4,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
76,77,6.8,2.8,4.8,1.4,Iris-versicolor
126,127,6.2,2.8,4.8,1.8,Iris-virginica

# 2. Fetch 50% of Data From The Dataset

In [11]:
data.sample(frac=0.50)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
38,39,4.4,3.0,1.3,0.2,Iris-setosa
139,140,6.9,3.1,5.4,2.1,Iris-virginica
128,129,6.4,2.8,5.6,2.1,Iris-virginica
67,68,5.8,2.7,4.1,1.0,Iris-versicolor
129,130,7.2,3.0,5.8,1.6,Iris-virginica
...,...,...,...,...,...,...
59,60,5.2,2.7,3.9,1.4,Iris-versicolor
64,65,5.6,2.9,3.6,1.3,Iris-versicolor
46,47,5.1,3.8,1.6,0.2,Iris-setosa
5,6,5.4,3.9,1.7,0.4,Iris-setosa
23,24,5.1,3.3,1.7,0.5,Iris-setosa

# 3. random_state

In [18]:
data.sample(n=3,random_state=200)

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
84,85,5.4,3.0,4.5,1.5,Iris-versicolor
122,123,7.7,2.8,6.7,2.0,Iris-virginica
28,29,5.2,3.4,1.4,0.2,Iris-setosa

# 4. Replace

In [19]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
df1=pd.DataFrame(data1)

In [20]:
df1

      Name  Marks
0  Priyang     98
1   Aadhya     99
2   Vedant     89
3   Parshv     85
4   krisha     87

In [46]:
df1.sample(n=3,replace=True)

      Name  Marks
0  Priyang     98
4   krisha     87
0  Priyang     98

# 5. Axis

In [54]:
data.sample(n=3,axis='index')

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
86,87,6.7,3.1,4.7,1.5,Iris-versicolor
128,129,6.4,2.8,5.6,2.1,Iris-virginica
145,146,6.7,3.0,5.2,2.3,Iris-virginica

# 6. Weights

In [55]:
data1 = {'Name':['Priyang','Aadhya','Vedant','Parshv','krisha'],
         'Marks':[98,99,89,85,87]}
df1=pd.DataFrame(data1)

In [56]:
df1

      Name  Marks
0  Priyang     98
1   Aadhya     99
2   Vedant     89
3   Parshv     85
4   krisha     87

In [60]:
w=[0.1,0.5,0.8,0.3,0.2]
df1.sample(n=3,weights=w)

     Name  Marks
2  Vedant     89
1  Aadhya     99
3  Parshv     85

# 7. Pandas Series

In [62]:
type(df1['Name'])

pandas.core.series.Series

In [63]:
df1['Name'].sample(n=3)

1     Aadhya
3     Parshv
0    Priyang
Name: Name, dtype: object